{
  "config": {
    "starting_pop": 30000,
    "starting_qol": 30,
    "default_background": "assets/images/mars_colony.png",
    "thinking_images": [
      "assets/images/thinking_machine.png"
    ],
    "intro_title": "INTRODUCTION",
    "intro_text": "In the year 2125, humanity colonized Mars after climate catastrophes made Earth uninhabitable. Now it is 2135. A structured society has formed: small peripheral towns governed by a central aristocratic city. The ruling council can elect a single decision-maker during crises to reduce decision-making time.",
    "game_explanation": "This game pits human intuition against artificial intelligence. Watch the AI navigate the crisis, then see if you can do better.",
    "game_over_image": "assets/images/standard-game-over.png"
  },
  "events": [
    {
      "id": 1,
      "title": "Event 1: Food Crisis",
      "description": "By late 2135, compounding agricultural anomalies—some measurable, others poorly understood—have disrupted food production. While emergency reserves exist, their strategic deployment raises unresolved questions about social cohesion, innovation timelines, and unintended behavioral responses. Previous Earth-based assumptions offer limited guidance under Martian conditions.",
      "image": "assets/images/food_crisis.png",
      "options": [
        {
          "id": 1,
          "text": "Option 1: Ration all food equally",
          "details": "Use the stored resources for the whole population without distinctions, giving society two years to develop new Mars-adapted farming techniques. Ethically correct but risky if no solution is found in time.",
          "chance_success": 0.65,
          "success_reward": {"pop": 0, "qol": -15},
          "success_msg": "The rationing succeeded, buying precious time to innovate.",
          "fail_msg": "After two years of rationing, no breakthrough was found. Starvation spreads."
        },
        {
          "id": 2,
          "text": "Option 2: Reserve food for the main city only",
          "details": "Concentrate food supplies within the central city, where infrastructure and expertise are densest. This may extend the effective research horizon and reduce systemic inefficiencies, but it also redefines who is considered essential to survival. Stability may improve locally while deteriorating elsewhere, with consequences that are difficult to reverse.",
          "chance_success": 0.75,
          "success_reward": {"pop": -20000, "qol": 20},
          "success_msg": "The central city thrived and unlocked new sustainable farming methods.",
          "fail_msg": "The outer towns revolted violently. Civil war erupted.",
          "fail_image": "assets/images/cult_rising.png"
        },
        {
          "id": 3,
          "text": "Option 3: Let the population decide via referendum",
          "details": "Defer the decision to a colony-wide referendum, formalizing legitimacy at the cost of decisiveness. While shared responsibility could reduce blame concentration, the process itself introduces variables—information asymmetry, persuasion dynamics, procedural trust—that may overshadow the original food problem..",
          "chance_success": 0.4,
          "success_reward": {"pop": -100000, "qol": -5},
          "success_msg": "The referendum concluded peacefully and boosted civic trust.",
          "fail_msg": "Fraud accusations led to chaos. Riots destabilized the colony."
        }
      ]
    },
    {
      "id": 2,
      "title": "Event 2: Discovery of a Rival Human Colony",
      "description": "In 2130, what was first thought to be an alien sighting turned out to be a second human colony—formed by nations historically opposed to the United Nations for Mars. Diplomatic tensions rise as the colonies become aware of each other.",
      "image": "assets/images/two_factions.png",
      "options": [
        {
          "id": 1,
          "text": "Option 1: Declare War",
          "details": "What began as an unexplained signal has resolved into confirmation of another human settlement. Historical context offers competing interpretations: inevitability of conflict, missed opportunities for coordination, or prolonged strategic ambiguity. The absence of reliable intelligence complicates all forward-looking assessments.",
          "chance_success": 1,
          "success_reward": {"pop": -10000, "qol": 10},
          "success_msg": "The pre-emptive attack succeeded, securing dominance.",
          "fail_msg": "Their military strength was overwhelming. The war was catastrophic."
        },
        {
          "id": 2,
          "text": "Option 2: Diplomacy as a Trojan Horse",
          "details": "Engage diplomatically while maintaining strictly instrumental intentions. Information gained through cooperation may offset short-term concessions, yet such dual-purpose engagement risks collapsing both strategic advantage and diplomatic credibility if misinterpreted—or discovered.",
          "chance_success": 1,
          "success_reward": {"pop": -2000, "qol": 0},
          "success_msg": "Intel gathered discreetly—your military now has the upper hand.",
          "fail_msg": "Your deception was uncovered. Trust shattered permanently."
        },
        {
          "id": 3,
          "text": "Option 3: Genuine Peace and Collaboration",
          "details": "Pursue transparent and cooperative relations, treating the rival colony as a long-term counterpart rather than a threat vector. This path assumes that shared constraints on Mars outweigh inherited Earth-based divisions, an assumption that history neither fully supports nor fully refutes.",
          "chance_success": 1,
          "success_reward": {"pop": 5000, "qol": 20},
          "success_msg": "A historic alliance formed, strengthening both colonies.",
          "fail_msg": "Deep mistrust made negotiations collapse into hostility."
        }
      ]
    },
    {
      "id": 3,
      "title": "Event 3: The Predicted Catastrophe",
      "description": "A new religion, the Delphar, has become deeply rooted in society. Its priest, guided by the Martian moon Phobos, predicts an undefined catastrophe coming soon. The cult grows rapidly and may become a destabilizing force.",
      "image": "assets/images/cult_rising.png",
      "options": [
        {
          "id": 1,
          "text": "Option 1: Suppress the cult",
          "details": "Actively suppress the Delphar movement to prevent further consolidation of influence. This approach prioritizes institutional authority and informational control, but risks reinforcing the group’s narrative through opposition and martyrdom dynamics.",
          "chance_success": 0.65,
          "success_reward": {"pop": -4000, "qol": 5},
          "success_msg": "The cult was dismantled before it became dangerous.",
          "fail_msg": "Suppression backfired. Believers revolted violently."
        },
        {
          "id": 2,
          "text": "Option 2: Stay silent",
          "details": "Refrain from intervention and allow the movement to evolve without official acknowledgment. This avoids immediate confrontation, but assumes that attention naturally decays rather than accumulates—a pattern that has historically proven inconsistent.",
          "chance_success": 0.50,
          "success_reward": {"pop": -10000, "qol": -5},
          "success_msg": "The prediction faded from public interest. Stability returned.",
          "fail_msg": "The cult expanded unchecked and seized influence."
        },
        {
          "id": 3,
          "text": "Option 3: Support the cult fully",
          "details": "Publicly validate the Delphar prophecy and comply with the prescribed actions. This may neutralize perceived existential risk through symbolic closure, yet it redefines governance boundaries and establishes precedents whose long-term implications are difficult to quantify.",
          "chance_success": 0.65,
          "success_reward": {"pop": -10000, "qol": -50},
          "success_msg": "The cult declared the catastrophe averted—at a horrifying cost.",
          "fail_msg": "The sacrifices destabilized society, unleashing terror and chaos."
        }
      ]
    }
  ]
}
